app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    if @book.save
---
INSERT INTO "books" ("title", "author", "publication_year", "created_at", "updated_at", "availability") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Rishita"], ["author", "Payasi"], ["publication_year", 1965], ["created_at", "2023-08-29 05:44:09.987104"], ["updated_at", "2023-08-29 05:44:09.987104"], ["availability", 1]]