app/controllers/borrowers_controller.rb

SELECT "borrowers".* FROM "borrowers"
---
  def index
    @borrowers = Borrower.all

INSERT INTO "borrowers" ("name", "contact_info", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "rishita"], ["contact_info", "rishita@gmail.com"], ["created_at", "2023-08-29 05:35:33.048004"], ["updated_at", "2023-08-29 05:35:33.048004"]]
---
  def create
    @borrower = Borrower.new(borrower_params)

    if @borrower.save