app/controllers/borrowings_controller.rb

SELECT "borrowings".* FROM "borrowings"
---
  def index
    @borrowings = Borrowing.all

INSERT INTO "borrowings" ("book_id", "borrower_id", "return_date", "returned", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["book_id", 2], ["borrower_id", 2], ["return_date", "2021-10-21"], ["returned", 1], ["created_at", "2023-08-29 06:12:57.826082"], ["updated_at", "2023-08-29 06:12:57.826082"]]
---
  def create
    @borrowing = Borrowing.new(borrowing_params)
    if @borrowing.save