app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "simi@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-08-29 06:27:36.854123"], ["updated_at", "2023-08-29 06:27:36.854123"]]