app/models/validates.rb

SELECT 1 AS one FROM "books" WHERE "books"."id" != ? AND "books"."title" = ? LIMIT ?  [["id", 1], ["title", "Pallavi"], ["LIMIT", 1]]
---
  def validate_title(record)
    if record.title.blank?
      record.errors.add(:title, "can't be blank")
    elsif Book.where.not(id: record.id).exists?(title: record.title)